In [129]:
################### Filtering Rows and Columns

In [130]:
# Create dataframe from dictionary
import pandas as pd
dict={
    "f_name":["Sony","Pragya","Prasanna","Ram","Hari","Sita"],
    "l_name":["Shrestha","Shrestha","Shrestha","Prasad","Kumar","Giri"],
    "age":[24,27,19,24,27,19]
}
df=pd.DataFrame(dict)
df

    f_name    l_name  age
0     Sony  Shrestha   24
1   Pragya  Shrestha   27
..     ...       ...  ...
4     Hari     Kumar   27
5     Sita      Giri   19

[6 rows x 3 columns]

In [133]:
# Filtering rows
df[df["l_name"]=="Shrestha"]

     f_name    l_name  age
0      Sony  Shrestha   24
1    Pragya  Shrestha   27
2  Prasanna  Shrestha   19

In [142]:
# Filtering rows and columns
df.loc[df["l_name"]=="Shrestha","f_name":"age"]

     f_name    l_name  age
0      Sony  Shrestha   24
1    Pragya  Shrestha   27
2  Prasanna  Shrestha   19

In [143]:
# Filtering rows and columns
df.loc[df["l_name"]=="Shrestha",["f_name","age"]]

     f_name  age
0      Sony   24
1    Pragya   27
2  Prasanna   19

In [145]:
# Filtering rows and columns with multiple conidtions
df.loc[(df["l_name"]=="Shrestha") & (df["f_name"]=="Sony"),["f_name","age"]]

  f_name  age
0   Sony   24

In [146]:
# Filtering rows and columns with multiple conidtions
df.loc[(df["l_name"]=="Shrestha") | (df["f_name"]=="Hari"),["f_name","age"]]

     f_name  age
0      Sony   24
1    Pragya   27
2  Prasanna   19
4      Hari   27

In [151]:
# Filtering rows and columns with condition last name in Shrestha and Prasad
df.loc[df["l_name"].isin(["Shrestha","Prasad"]),["f_name","l_name","age"]]

     f_name    l_name  age
0      Sony  Shrestha   24
1    Pragya  Shrestha   27
2  Prasanna  Shrestha   19
3       Ram    Prasad   24

In [155]:
# Filtering rows and columns with condition last name in Shrestha and Prasad
df.loc[df["f_name"].str.contains("s"),["f_name","l_name","age"]]

     f_name    l_name  age
2  Prasanna  Shrestha   19